aaron-bond.better-comments
adpyke.codesnap
batisteo.vscode-django
bierner.markdown-checkbox
bierner.markdown-preview-github-styles
cardinal90.multi-cursor-case-preserve
celianriboulet.webvalidator
chrmarti.regex
clemenspeters.format-json
cschlosser.doxdocgen
cstrap.flask-snippets
cweijan.dbclient-jdbc
cweijan.vscode-mysql-client2
darkriszty.markdown-table-prettify
dart-code.dart-code
dart-code.flutter
dawhite.mustache
dimitarnonov.jellybeans-theme
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
figma.figma-vscode-extension
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
golang.go
hbenl.vscode-test-explorer
jamesmaj.easy-icons
janisdd.vscode-edit-csv
junstyle.vscode-django-support
khaeransori.json2csv
lirobi.phone-preview
littlefoxteam.vscode-python-test-adapter
luggage66.awk
magicstack.magicpython
markosth09.color-picker
matangover.mypy
mechatroner.rainbow-csv
mervin.markdown-formatter
mikestead.dotenv
mohammadbaqer.better-folding
mongodb.mongodb-vscode
monish.regexsnippets
monosans.djlint
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.test-adapter-converter
nextbook.file-and-folder-icons
njpwerner.autodocstring
oracle.oracle-java
orta.vscode-jest
oven.bun-vscode
postman.postman-for-vscode
redhat.java
shinotatwu-ds.file-tree-generator
shopify.ruby-extensions-pack
shopify.ruby-lsp
sibiraj-s.vscode-scss-formatter
timonwong.shellcheck
vincaslt.highlight-matching-tag
vscjava.vscode-java-debug
vscjava.vscode-java-test
wayou.vscode-todo-highlight
yandeu.five-server
zhangyd.ascii-table
