# Setup Homebrew Taps, Packages, Casks, VS Code Extensions, Go and Rust Tools

# Directory to install casks into
cask_args appdir: "/Applications"

# Homebrew Taps
tap "adembc/tap"
tap "gromgit/brewtils"
tap "hashicorp/tap"
tap "italolelis/reachable"
tap "jenkins-zh/jcli"
tap "jesseduffield/lazydocker"
tap "kriuchkov/tap"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "shellspec/shellspec"
tap "simplydanny/pass-extensions"
tap "spring-io/tap"

# Homebrew Packages
brew "ack"
brew "tree"
brew "ansible"
brew "atuin", restart_service: :changed
brew "awk"
brew "awscli"
brew "bash"
brew "bat"
brew "bison"
brew "bottom"
brew "broot"
brew "btop"
brew "cheat"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "couchdb", restart_service: :changed
brew "csvlens"
brew "curlie"
brew "doggo"
brew "duckdb"
brew "duf"
brew "dust"
brew "eslint"
brew "fail2ban"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "firebase-cli"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-pages-cli"
brew "glances"
brew "glow"
brew "gnu-sed"
brew "gnu-units"
brew "gnupg"
brew "go"
brew "gping"
brew "grafana", restart_service: :changed
brew "grep"
brew "grex"
brew "html-to-markdown"
brew "htop"
brew "httpd", restart_service: :changed
brew "httpie"
brew "hyperfine"
brew "imagemagick"
brew "iproute2mac"
brew "jenkins-lts", restart_service: :changed
brew "openjdk"
brew "kafka", restart_service: :changed
brew "kotlin"
brew "kubernetes-cli"
brew "lazygit"
brew "localtunnel"
brew "luarocks"
brew "maven"
brew "mcat"
brew "mcfly"
brew "memcached", restart_service: :changed
brew "minikube"
brew "mkcert"
brew "mongodb-atlas-cli"
brew "mycli"
brew "mysql", restart_service: :changed
brew "mysql-to-sqlite3"
brew "neovim"
brew "netshow"
brew "nginx", restart_service: :changed
brew "ninja"
brew "nmap"
brew "nvm"
brew "pandoc"
brew "pass"
brew "pass-import"
brew "pastel"
brew "pcre"
brew "pgcli"
brew "pgloader"
brew "php", restart_service: :changed
brew "pkgconf"
brew "postgresql@18", restart_service: :changed
brew "powerlevel10k"
brew "prettier"
brew "procs"
brew "prometheus", restart_service: :changed
brew "python-tk@3.14"
brew "rabbitmq", restart_service: :changed
brew "redis", restart_service: :changed
brew "rich-cli"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sd"
brew "shellcheck"
brew "shellspec"
brew "snitch"
brew "sqlite3-to-mysql"
brew "stow"
brew "superfile"
brew "superseedr"
brew "swift"
brew "tcpstat"
brew "tectonic"
brew "termshot"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "treemd"
brew "typescript"
brew "uv"
brew "watchman"
brew "wget"
brew "wifitui"
brew "xh"
brew "yt-dlp"
brew "adembc/tap/lazyssh"
brew "gromgit/brewtils/taproom"
brew "hashicorp/tap/terraform"
brew "italolelis/reachable/reachable"
brew "jenkins-zh/jcli/jcli"
brew "jesseduffield/lazydocker/lazydocker"
brew "kriuchkov/tap/tock"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "simplydanny/pass-extensions/pass-update"
brew "spring-io/tap/spring-boot"

# Homebrew Casks
cask "betterdisplay"
cask "blender"
cask "brave-browser"
cask "chatgpt"
cask "datagrip"
cask "discord"
cask "docker-desktop"
cask "drawio"
cask "dropbox"
cask "excalidrawz"
cask "figma"
cask "framer"
cask "gimp"
cask "github"
cask "gitkraken"
cask "gitkraken-cli"
cask "google-chrome"
cask "google-drive"
cask "httpie-desktop"
cask "miro"
cask "mysql-shell"
cask "neohtop"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "obs"
cask "obsidian"
cask "rawtherapee"
cask "rectangle"
cask "slack"
cask "swift-quit"
cask "visual-studio-code"
cask "vlc"
cask "zen"
cask "zoom"

# Go Tools
go "github.com/karol-broda/snitch"
go "github.com/presbrey/cmd/ss"
go "github.com/CodeOne45/vex-tui"

# Rust Tools
cargo "headson"
cargo "terminusdm"
cargo "tree-sitter-cli"
